Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: Rather than requiring you to put parentheses around every function call and declare every variable, you can often leave such explicit elements off and Perl will figure out what you meant.
es_es: En vez de obligarle a poner paréntesis en todas las llamadas de función y declarar cada variable, puede, a menudo, dejar algunos elementos de forma explícita y Perl intentará adivinar lo que quiere decir.

source: This is known as B<Do What I Mean>, abbreviated B<DWIM>.
es_es: Esto es conocido como B<Do What I Mean> (haz lo que digo), abreviado como B<DWIM>.

source: It allows programmers to be B<lazy> and to code in a style with which they are comfortable.
es_es: Permite a los programadores ser B<perezosos> y codificar en un estilo en que se encuentran más cómodos.

source: Perl B<borrows syntax> and concepts from many languages: awk, sed, C, Bourne Shell, Smalltalk, Lisp and even English.
es_es: Perl B<toma prestada sintaxis> y conceptos de muchos lenguajes: awk, sed, C, Bourne Shell, Smalltalk, Lisp e incluso inglés.

source: Other languages have borrowed syntax from Perl, particularly its regular expression extensions.
es_es: Otros lenguajes han tomado prestada la sintaxis de Perl, particularmente sus extensiones de expresiones regulares.

source: So if you have programmed in another language you will see familiar pieces in Perl.
es_es: Así que si ha programado en otro lenguaje verá partes en Perl que le serán familiares.

source: They often work the same, but see L<perltrap> for information about how they differ.
es_es: A menudo funcionan de la misma forma, pero mire L<perltrap> para ver en cómo difieren.

source: =head2 Declarations X<declaration> X<undef> X<undefined> X<uninitialized>
es_es: =head2 Declaraciones X<declaración> X<undef> X<indefinido> X<no inicializado>

source: The only things you need to declare in Perl are report formats and subroutines (and sometimes not even subroutines).
es_es: Los únicos elementos que necesita declarar en Perl son los informes y las subrutinas (y algunas veces ni siquiera las subrutinas).

source: A variable holds the undefined value (C<undef>) until it has been assigned a defined value, which is anything other than C<undef>.
es_es: Una variable almacena el valor indefinido (C<undef>) hasta que le es asignado un valor definido, que es cualquier otra cosa que no sea C<undef>.

source: When used as a number, C<undef> is treated as C<0>; when used as a string, it is treated as the empty string, C<"">; and when used as a reference that isn't being assigned to, it is treated as an error.
es_es: Cuando se usa como un número, C<undef> es tratado como C<0>; cuando se usa como una cadena de caracteres (I<string>), se trata como el string vacío, C<"">; y cuando se usa como una referencia que no ha sido asignada, es tratado como un error.

source: If you enable warnings, you'll be notified of an uninitialized value whenever you treat C<undef> as a string or a number.
es_es: Si ha activado los avisos (warnings), será notificado de un valor no inicializado cuando trate C<undef> como un string o número.

source: Well, usually.
es_es: Bueno, normalmente.

source: Boolean contexts, such as:
es_es: En contextos booleanos, como en:

source: are exempt from warnings (because they care about truth rather than definedness).
es_es: están exentos de los avisos (porque se fijan en el valor de verdad en vez de ver si está definido).

source: Operators such as C<++>, C<-->, C<+=>, C<-=>, and C<.=>, that operate on undefined left values such as:
es_es: Operadores como C<++>, C<-->, C<+=>, C<-=> y C<.=>, que operan sobre valores no definidos como en:

source: are also always exempt from such warnings.
es_es: están también exentos de tales avisos.

source: A declaration can be put anywhere a statement can, but has no effect on the execution of the primary sequence of statements--declarations all take effect at compile time.
es_es: Una declaración puede ponerse en cualquier sitio, como si fuera una sentencia, pero no tiene efecto en la ejecución de las secuencias de sentencias; todas las declaraciones toman efecto en tiempo de compilación.

source: Typically all the declarations are put at the beginning or the end of the script.
es_es: Típicamente, todas las declaraciones se ponen al comienzo o al final del script.

source: However, if you're using lexically-scoped private variables created with C<my()>, you'll have to make sure your format or subroutine definition is within the same block scope as the my if you expect to be able to access those private variables.
es_es: Sin embargo, si está usando variables privadas de un contexto local creadas con C<my()>, deberá asegurarse que su definición de formato o subrutina están dentro del mismo bloque que el C<my> si quiere acceder a estas variables privadas.

source: Declaring a subroutine allows a subroutine name to be used as if it were a list operator from that point forward in the program.
es_es: Declarar una subrutina permite que su nombre sea usado como si fuera un operador de lista desde el punto de vista del programa.

source: You can declare a subroutine without defining it by saying C<sub name>, thus: X<subroutine, declaration>
es_es: Puede declarar una subrutina sin definirla diciendo C<sub nombre>, como: X<subrutina, declaración>

source: sub myname;
es_es: sub minombre;

source: $me = myname $0 or die "can't get myname";
es_es: $yo = minombre $0 or die "no puedo obtener minombre";

source: Note that myname() functions as a list operator, not as a unary operator; so be careful to use C<or> instead of C<||> in this case.
es_es: Note que minombre() funciona como un operador de lista, no como un operador unario; cuidado al usar C<or> en vez de C<||> en este caso.

source: However, if you were to declare the subroutine as C<sub myname ($)>, then C<myname> would function as a unary operator, so either C<or> or C<||> would work.
es_es: Sin embargo, si declara la subrutina como C<sub minombre ($)>, entonces C<minombre> funcionará como un operador unario, así que servirán tanto C<or> como C<||>.

source: Subroutines declarations can also be loaded up with the C<require> statement or both loaded and imported into your namespace with a C<use> statement.
es_es: Las declaraciones de subrutinas pueden cargarse también con la sentencia C<require> o cargadas e importadas en su espacio de nombres con la sentencia C<use>.

source: See L<perlmod> for details on this.
es_es: Ver L<perlmod> para detalles sobre esto.

source: A statement sequence may contain declarations of lexically-scoped variables, but apart from declaring a variable name, the declaration acts like an ordinary statement, and is elaborated within the sequence of statements as if it were an ordinary statement.
es_es: Una secuencia de sentencias pueden contener declaraciones de variables de ámbito léxico (privado), pero aparte de declarar un nombre de variable, la declaración actúa como una sentencia normal y es elaborada dentro de la secuencia de sentencias como si fuera una sentencia normal.

source: That means it actually has both compile-time and run-time effects.
es_es: Esto significa que tiene efectos tanto en tiempo de compilación como en tiempo de ejecución.

source: =head2 Comments X<comment> X<#>
es_es: =head2 Comentarios X<comentario> X<#>

source: Text from a C<"#"> character until the end of the line is a comment, and is ignored.
es_es: El texto desde un carácter C<"#"> hasta el fin de la línea es un comentario y es ignorado.

source: Exceptions include C<"#"> inside a string or regular expression.
es_es: Excepciones a esto son la inclusión de C<"#"> dentro de un string o una expresión regular.

source: =head2 Simple Statements X<statement> X<semicolon> X<expression> X<;>
es_es: =head2 Sentencias simples X<sentencia> X<punto y coma> X<expresión> X<;>

source: The only kind of simple statement is an expression evaluated for its side effects.
es_es: La única clase de sentencia simple que existe es una expresión evaluada por sus efectos colaterales.

source: Every simple statement must be terminated with a semicolon, unless it is the final statement in a block, in which case the semicolon is optional.
es_es: Cada sentencia simple debe terminarse en un punto y coma excepto si es la última sentencia de un bloque, en cuyo caso el punto y coma es opcional.

source: (A semicolon is still encouraged if the block takes up more than one line, because you may eventually add another line.) Note that there are some operators like C<eval {}> and C<do {}> that look like compound statements, but aren't (they're just TERMs in an expression), and thus need an explicit termination if used as the last item in a statement.
es_es: (Un punto y coma es aún así recomendable si el bloque tiene más de una línea, porque, eventualmente, puede añadir alguna línea más). Note que algunos operadores como C<eval {}> y C<do {}> parecen sentencias compuestas, pero no lo son (son sólo TÉRMINOS en una expresión) y es necesario una terminación explícita si se usa como el último punto de una sentencia.

source: =head2 Truth and Falsehood X<truth> X<falsehood> X<true> X<false> X<!> X<not> X<negation> X<0>
es_es: =head2 Verdad y Falsedad X<verdad> X<falsedad> X<true> X<false> X<!> X<not> X<negación> X<0>

source: The number 0, the strings C<'0'> and C<''>, the empty list C<()>, and C<undef> are all false in a boolean context.
es_es: El número 0, las cadenas C<'0'> y C<''>, la cadena vacía C<()> y C<undef> son todos falsos en contexto booleano.

source: All other values are true.
es_es: Todos los otros valores son verdadero.

source: Negation of a true value by C<!> or C<not> returns a special false value.
es_es: La negación del valor de verdadero con C<!> o C<not> devuelve un valor falso especial.

source: When evaluated as a string it is treated as C<''>, but as a number, it is treated as 0.
es_es: Cuando es evaluado como cadena es tratado como C<''>, pero como número es tratado como 0.

source: =head2 Statement Modifiers X<statement modifier> X<modifier> X<if> X<unless> X<while> X<until> X<foreach> X<for>
es_es: =head2 Modificadores de sentencias X<modificador de sentencias> X<modificador> X<if> X<unless> X<while> X<until> X<foreach> X<for>

source: Any simple statement may optionally be followed by a I<SINGLE> modifier, just before the terminating semicolon (or block ending).
es_es: Cualquier sentencia simple puede ser seguida opcionalmente por un I<ÚNICO> modificador, justo antes del punto y coma final (o del final del bloque).

source: The possible modifiers are:
es_es: Los posibles modificadores son:

source: foreach LIST
es_es: foreach LISTA

source: The C<EXPR> following the modifier is referred to as the "condition".
es_es: La C<EXPR> siguiente al modificador es referida como "condición".

source: Its truth or falsehood determines how the modifier will behave.
es_es: Su verdad o falsedad determina como se comportará el modificador.

source: C<if> executes the statement once I<if> and only if the condition is true.
es_es: C<if> ejecuta la sentencia una vez I<sí> y sólo si la condición es verdadera.

source: C<unless> is the opposite, it executes the statement I<unless> the condition is true (i.e., if the condition is false).
es_es: C<unless> es el opuesto, ejecuta la sentencia si la condición I<no es> verdadera (e.d., si la condición es falsa).

source: print "Basset hounds got long ears" if length $ear >= 10;
es_es: print "El perro de caza Basset tiene largas orejas" if length $oreja >= 10;

source: go_outside() and play() unless $is_raining;
es_es: vete_fuera() and juega() unless $esta_lloviendo;

source: The C<foreach> modifier is an iterator: it executes the statement once for each item in the LIST (with C<$_> aliased to each item in turn).
es_es: El modificador C<foreach> es un iterador: ejecuta la sentencia una vez por cada elemento en la LISTA (con C<$_> asociado a cada elemento en cada iteración).

# print "Hello $_! " foreach qw(world Dolly nurse);
source: print "Hello $_!\n" foreach qw(world Dolly nurse);
es_es: print "Hola $_!\n" foreach qw(mundo Dolly enfermera);

source: C<while> repeats the statement I<while> the condition is true.
es_es: C<while> repite la sentencia I<mientras> la condición sea cierta.

source: C<until> does the opposite, it repeats the statement I<until> the condition is true (or while the condition is false):
es_es: C<until> hace lo opuesto, repite la sentencia I<hasta> que la condición sea verdadera (o mientras la condición sea falsa):

source: # Both of these count from 0 to 10.
es_es: # Estas dos líneas cuentas de 0 a 10.

source: The C<while> and C<until> modifiers have the usual "C<while> loop" semantics (conditional evaluated first), except when applied to a C<do>-BLOCK (or to the deprecated C<do>-SUBROUTINE statement), in which case the block executes once before the conditional is evaluated.
es_es: Los modificadores C<while> u C<until> tienen la usual semántica de los "bucles C<while>" (la condición se evalúa primero), excepto cuando se aplica a un bloque C<do> (o a la depreciada sentencia subrutina C<do>), en cuyo caso el bloque se ejecuta una vez antes de sea evaluada la condición.

source: This is so that you can write loops like:
es_es: De esa manera puede escribir bucles como este:

source: do { $line = <STDIN>; ...
es_es: do { $linea = <STDIN>; ...

# } until $line eq ". ";
source: } until $line eq ".\n";
es_es: } until $linea eq ".\n";

source: See L<perlfunc/do>.
es_es: Ver L<perlfunc/do>.

source: Note also that the loop control statements described later will I<NOT> work in this construct, because modifiers don't take loop labels.
es_es: Note también que las sentencias de control de bucles descritas más adelante I<NO> funcionarán con esta construcción, porque los modificadores no toman etiquetas de bucle.

source: Sorry.
es_es: Lo sentimos.

source: You can always put another block inside of it (for C<next>) or around it (for C<last>) to do that sort of thing.
es_es: Siempre puede poner otro bloque dentro de él (para C<next>) o alrededor de él (para C<last>) para hacer esta suerte de cosas.

source: For C<next>, just double the braces: X<next> X<last> X<redo>
es_es: Para C<next>, solamente doble las llaves: X<next> X<last> X<redo>

source: do {{ next if $x == $y; # do something here
es_es: do {{ next if $x == $y; # hacer algo aquí

source: For C<last>, you have to be more elaborate: X<last>
es_es: Para C<last>, tiene que ser un poco más elaborado: X<last>

source: LOOP: { do { last if $x = $y**2; # do something here } while $x++ <= $z;
es_es: BUCLE: { do { last if $x = $y**2; # hacer algo aquí } while $x++ <= $z;

source: B<NOTE:> The behaviour of a C<my> statement modified with a statement modifier conditional or loop construct (e.g. C<my $x if ...>) is B<undefined>.
es_es: B<NOTA:> El comportamiento de una sentencia C<my> modificada con una sentencia de modificador condicional o construcción de bucle (p.e. C<my $x if ...>) es B<indefinido>.

source: The value of the C<my> variable may be C<undef>, any previously assigned value, or possibly anything else.
es_es: El valor de la variable C<my> puede ser C<undef>, cualquier valor anteriormente asignado , o posiblemente cualquier otra cosa.

source: Don't rely on it.
es_es: No confíe en él.

source: Future versions of perl might do something different from the version of perl you try it out on.
es_es: Futuras versiones de perl pueden hacer algo diferente de la versión de perl que esté probando.

source: Here be dragons.
es_es: Aquí hay dragones sueltos...

source: =head2 Compound Statements X<statement, compound> X<block> X<bracket, curly> X<curly bracket> X<brace> X<{> X<}> X<if> X<unless> X<while> X<until> X<foreach> X<for> X<continue>
es_es: =head2 Sentencias compuestas X<sentencia, compuesta> X<bloque> X<llave, paréntesis> X<corchete> X<{> X<}> X<if> X<unless> X<while> X<until> X<foreach> X<for> X<continue>

source: In Perl, a sequence of statements that defines a scope is called a block.
es_es: En Perl, una secuencia de sentencias que define un ámbito se llama un bloque.

source: Sometimes a block is delimited by the file containing it (in the case of a required file, or the program as a whole), and sometimes a block is delimited by the extent of a string (in the case of an eval).
es_es: Algunas veces un bloque está delimitado por el fichero que lo contiene (en el caso de un fichero requerido, o el programa entero) y otras veces un bloque está delimitado por la extensión de un string (en el caso de un eval).

source: But generally, a block is delimited by curly brackets, also known as braces.
es_es: Pero generalmente, un bloque está delimitado por llaves.

source: We will call this syntactic construct a BLOCK.
es_es: Llamaremos a esta construcción sintáctica un BLOQUE.

source: The following compound statements may be used to control flow:
es_es: Las siguientes sentencias compuestas pueden ser usadas para controlar el flujo:

source: if (EXPR) BLOCK
es_es: if (EXPR) BLOQUE

source: if (EXPR) BLOCK else BLOCK
es_es: if (EXPR) BLOQUE else BLOQUE

source: if (EXPR) BLOCK elsif (EXPR) BLOCK ... else BLOCK
es_es: if (EXPR) BLOQUE elsif (EXPR) BLOQUE ... else BLOQUE

source: LABEL while (EXPR) BLOCK
es_es: ETIQUETA while (EXPR) BLOQUE

source: LABEL while (EXPR) BLOCK continue BLOCK
es_es: ETIQUETA while (EXPR) BLOQUE continue BLOQUE

source: LABEL until (EXPR) BLOCK
es_es: ETIQUETA until (EXPR) BLOQUE

source: LABEL until (EXPR) BLOCK continue BLOCK
es_es: ETIQUETA until (EXPR) BLOQUE continue BLOQUE

source: LABEL for (EXPR; EXPR; EXPR) BLOCK
es_es: ETIQUETA for (EXPR; EXPR; EXPR) BLOQUE

source: LABEL foreach VAR (LIST) BLOCK
es_es: ETIQUETA foreach VAR (LISTA) BLOQUE

source: LABEL foreach VAR (LIST) BLOCK continue BLOCK
es_es: ETIQUETA foreach VAR (LISTA) BLOQUE continue BLOQUE

source: LABEL BLOCK continue BLOCK
es_es: ETIQUETA BLOQUE continue BLOQUE

source: Note that, unlike C and Pascal, these are defined in terms of BLOCKs, not statements.
es_es: Note que, a diferencia del C y Pascal, están definidas en términos de BLOQUES, no sentencias.

source: This means that the curly brackets are I<required>--no dangling statements allowed.
es_es: Esto significa que las llaves son I<necesarias> --no se permiten sentencias sueltas.

source: If you want to write conditionals without curly brackets there are several other ways to do it.
es_es: Si quiere escribir condicionales sin llaves hay varias formas de hacerlo.

source: The following all do the same thing:
es_es: Todo lo siguiente hace lo mismo:

source: if (!open(FOO)) { die "Can't open $FOO: $!"; }
es_es: if (!open(FOO)) { die "No puedo abrir $FOO: $!"; }

source: die "Can't open $FOO: $!" unless open(FOO);
es_es: die "No puedo abrir $FOO: $!" unless open(FOO);

source: open(FOO) or die "Can't open $FOO: $!"; # FOO or bust!
es_es: open(FOO) or die "No puedo abrir $FOO: $!"; # ¡FOO o quieto!

source: 'hi mom' : die "Can't open $FOO: $!"; # a bit exotic, that last one
es_es: 'hola mama' : die "No puedo abrir $FOO: $!"; # Un poco exótico, este último

source: The C<if> statement is straightforward.
es_es: La sentencia C<if> es sencilla.

source: Because BLOCKs are always bounded by curly brackets, there is never any ambiguity about which C<if> an C<else> goes with.
es_es: Como los BLOQUES están siempre rodeados de llaves, nunca hay ambigüedad sobre dónde van el C<if> y el C<else>.

source: If you use C<unless> in place of C<if>, the sense of the test is reversed.
es_es: Si usa C<unless> en lugar de C<if>, el sentido del test es invertido.

source: The C<while> statement executes the block as long as the expression is true (does not evaluate to the null string C<""> or C<0> or C<"0">).
es_es: La sentencia C<while> ejecuta el bloque mientras la expresión sea verdadera (no evalúe al string nulo C<""> o C<0> o C<"0">).

source: The C<until> statement executes the block as long as the expression is false.
es_es: La sentencia C<until> ejecuta el bloque mientras la expresión sea falsa.

source: The LABEL is optional, and if present, consists of an identifier followed by a colon.
es_es: La ETIQUETA es opcional, y si está presente, consiste en un identificador seguido por el carácter dos puntos.

source: The LABEL identifies the loop for the loop control statements C<next>, C<last>, and C<redo>.
es_es: La ETIQUETA identifica el bucle para las sentencias de control de bucle C<next>, C<last> y C<redo>.

source: If the LABEL is omitted, the loop control statement refers to the innermost enclosing loop.
es_es: Si la ETIQUETA se omite, las sentencias de control de bucle se refieren al bucle más interior en que se encuentren.

source: This may include dynamically looking back your call-stack at run time to find the LABEL.
es_es: Así se puede implementar dinámicamente una retrollamada a la pila de llamadas en tiempo real para encontrar la ETIQUETA.

source: Such desperate behavior triggers a warning if you use the C<use warnings> pragma or the B<-w> flag.
es_es: Tal desesperado comportamiento lanzará un aviso si usa el pragma C<use warnings> o la opción B<-w>.

source: If there is a C<continue> BLOCK, it is always executed just before the conditional is about to be evaluated again.
es_es: Si existe un BLOQUE C<continue>, siempre es ejecutado justo antes de que la condición sea evaluada de nuevo.

source: Thus it can be used to increment a loop variable, even when the loop has been continued via the C<next> statement.
es_es: Así, puede ser usada para incrementar una variable de bucle, incluso cuando la iteración ha sido cortada vía la sentencia C<next>.

source: =head2 Loop Control X<loop control> X<loop, control> X<next> X<last> X<redo> X<continue>
es_es: =head2 Control de bucles X<control de bucles> X<bucle, control> X<next> X<last> X<redo> X<continue>

source: The C<next> command starts the next iteration of the loop:
es_es: El comando C<next> inicia la siguiente iteración del bucle:

source: LINE: while (<STDIN>) { next LINE if /^#/; # discard comments ...
es_es: LINEA: while (<STDIN>) { next LINEA if /^#/; # desecha los comentarios ...

source: The C<last> command immediately exits the loop in question.
es_es: El comando C<last> sale inmediatamente del bucle en cuestión.

source: LINE: while (<STDIN>) { last LINE if /^$/; # exit when done with header ...
es_es: LINEA: while (<STDIN>) { last LINEA if /^$/; # salir cuando se termine la cabecera ...

source: The C<continue> block, if any, is I<not> executed.
es_es: El bloque C<continue>, si está, no es ejecutado:

source: This command is normally used by programs that want to lie to themselves about what was just input.
es_es: Este comando se usa normalmente por los programas que quieren mentirse a sí mismos sobre lo que fue introducido.

source: For example, when processing a file like F</etc/termcap>.
es_es: Por ejemplo, cuando se procesa un fichero como F</etc/termcap>.

source: If your input lines might end in backslashes to indicate continuation, you want to skip ahead and get the next record.
es_es: Si las líneas de entrada acaban en contra barras para indicar continuación, querrá saltarlo y obtener el siguiente registro.

source: while (<>) { chomp; if (s/\\$//) { $_ .= <>; redo unless eof(); } # now process $_
es_es: while (<>) { chomp; if (s/\\$//) { $_ .= <>; redo unless eof(); } # ahora procesar $_

source: which is Perl short-hand for the more explicitly written version:
es_es: que es la versión corta de la versión más explícita:

source: LINE: while (defined($line = <ARGV>)) { chomp($line); if ($line =~ s/\\$//) { $line .= <ARGV>; redo LINE unless eof(); # not eof(ARGV)!
es_es: LINEA: while (defined($linea = <ARGV>)) { chomp($linea); if ($linea =~ s/\\$//) { $linea .= <ARGV>; redo LINEA unless eof(); # not eof(ARGV)!

source: } # now process $line
es_es: } # ahora procesar $linea
